{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.0.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Conv_1_MELSPECT/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "Conv_1_MELSPECT/bias", "shape": [64], "dtype": "float32"}, {"name": "BatchNorm_1_MELSPECT/gamma", "shape": [64], "dtype": "float32"}, {"name": "BatchNorm_1_MELSPECT/beta", "shape": [64], "dtype": "float32"}, {"name": "BatchNorm_1_MELSPECT/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "BatchNorm_1_MELSPECT/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "Conv_2_MELSPECT/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Conv_2_MELSPECT/bias", "shape": [64], "dtype": "float32"}, {"name": "BatchNorm_2_MELSPECT/gamma", "shape": [64], "dtype": "float32"}, {"name": "BatchNorm_2_MELSPECT/beta", "shape": [64], "dtype": "float32"}, {"name": "BatchNorm_2_MELSPECT/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "BatchNorm_2_MELSPECT/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "Conv_3_MELSPECT/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Conv_3_MELSPECT/bias", "shape": [128], "dtype": "float32"}, {"name": "BatchNorm_3_MELSPECT/gamma", "shape": [128], "dtype": "float32"}, {"name": "BatchNorm_3_MELSPECT/beta", "shape": [128], "dtype": "float32"}, {"name": "BatchNorm_3_MELSPECT/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "BatchNorm_3_MELSPECT/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "Conv_4_MELSPECT/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "Conv_4_MELSPECT/bias", "shape": [128], "dtype": "float32"}, {"name": "BatchNorm_4_MELSPECT/gamma", "shape": [128], "dtype": "float32"}, {"name": "BatchNorm_4_MELSPECT/beta", "shape": [128], "dtype": "float32"}, {"name": "BatchNorm_4_MELSPECT/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "BatchNorm_4_MELSPECT/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "LSTM_1/lstm_cell/kernel", "shape": [128, 1024], "dtype": "float32"}, {"name": "LSTM_1/lstm_cell/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "LSTM_1/lstm_cell/bias", "shape": [1024], "dtype": "float32"}, {"name": "FC/kernel", "shape": [256, 7], "dtype": "float32"}, {"name": "FC/bias", "shape": [7], "dtype": "float32"}]}]}